Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОсновнойДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГосударственногоОргана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГосударственныхОрганов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГосударственногоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСамозанятый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНерезидентаРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКАТОДляТаможни</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКонтактнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СервисДоставкиБП/Ext/Module.bsl
// Заполняет параметры заказа на доставку данными из объекта-основания заказа.
//
// Параметры:
//  Параметры - см. СервисДоставки.НовыйПараметрыЗаказаНаДоставку
//
Процедура ЗаполнитьПараметрыЗаказаНаДоставку(Параметры) Экспорт
	
	ДокументыОснования = Параметры.ДокументыОснования;
	
	Если ДокументыОснования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонЗапросаШапка = ШаблонЗапросаДанныеШапкиДокумента();
	ШаблонЗапросаТовары = ШаблонЗапросаТоварыДокумента();
	
	Основания = ДокументыОснования.ВыгрузитьЗначения();
	ОснованияПоТипам = ОбщегоНазначенияБП.РазложитьСписокПоТипамЗначенийОбъектов(Основания);
	ПервыйЗапросПоШапке = Истина;
	ПервыйЗапросПоТоварам = Истина;
	ТекстЗапроса = "";
	ТекстЗапросаПоШапке = "";
	ТекстЗапросаПоТоварам = "";
	ТекстЗапросаВидовЗапасов = "";
	
	Для Каждого КлючИЗначение Из ОснованияПоТипам Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(КлючИЗначение.Ключ);
		ИмяТаблицыОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ИмяОбъекта = СтрРазделить(ИмяТаблицыОбъекта, ".")[1];
		
		ТекстЗапросаПоТипу = ШаблонЗапросаШапка;
		ИзменитьТекстЗапросаПоРеквизитамШапкиОбъекта(ТекстЗапросаПоТипу, ИмяОбъекта, МетаданныеОбъекта);
		ДополнитьЗапросПоОснованиям(ТекстЗапросаПоШапке, ТекстЗапросаПоТипу, ПервыйЗапросПоШапке, ИмяТаблицыОбъекта);
		
		СписокТабличныхЧастейТовары = Новый Массив();
		СписокТабличныхЧастейТовары.Добавить("Товары");
		
		Для Каждого ИмяТаблицыТЧ Из СписокТабличныхЧастейТовары Цикл
		
			ТекстЗапросаПоТипу = ШаблонЗапросаТовары;
			
			Если МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТаблицыТЧ) <> Неопределено Тогда
				
				МетаданныеОбъектаТЧ = МетаданныеОбъекта.ТабличныеЧасти[ИмяТаблицыТЧ]; // Структура
				ИмяТаблицыТЧОбъекта = ИмяТаблицыОбъекта + "." + МетаданныеОбъектаТЧ.Имя;
				
				ИзменитьТекстЗапросаПоРеквизитамТабличнойЧастиОбъекта(ТекстЗапросаПоТипу, МетаданныеОбъектаТЧ, Параметры);
				ДополнитьЗапросПоОснованиям(ТекстЗапросаПоТоварам, ТекстЗапросаПоТипу, ПервыйЗапросПоТоварам, ИмяТаблицыТЧОбъекта);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапросаПоШапке + ОбщегоНазначения.РазделительПакетаЗапросов() 
	+ ТекстЗапросаВыборкаИзДанныхОснований();
	
	Если ТекстЗапросаПоТоварам <> "" Тогда 
		ТекстЗапроса = ТекстЗапроса 
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаПоТоварам
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаВыборкаИзДанныхОснованийПоТоварам();
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Основания", Основания);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("РозничныйПокупатель", Справочники.Контрагенты.ПустаяСсылка());
	
	
	ДанныеПоУмолчанию = СервисДоставки.ПараметрыПоУмолчанию(Параметры.ТипГрузоперевозки);
	
	Запрос.УстановитьПараметр("СпособОпределенияКонтактногоЛица", ДанныеПоУмолчанию.СпособОпределенияКонтактногоЛица);
	Запрос.УстановитьПараметр("ОтветственныйПоУмолчанию", ДанныеПоУмолчанию.КонтактноеЛицо);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	УстановитьПривилегированныйРежим(Истина);
	Результаты = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатПоШапке = Результаты[1];
	Если РезультатПоШапке.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПоДокументу = РезультатПоШапке.Выгрузить();
	ДанныеПоДокументу = ТаблицаПоДокументу[0];
	
	СервисДоставкиКлиентСервер.ЗаполнитьСтруктуруПоЛинейнымДанным(Параметры, ДанныеПоДокументу, ТаблицаПоДокументу.Колонки);
	
	Параметры.Вставить("ОрганизацияБизнесСетиСсылка", ДанныеПоДокументу.ОрганизацияБизнесСетиСсылка);
	
	// Заполним грузоперевозчика
	Если ЗначениеЗаполнено(Параметры.Грузоперевозчик.Ссылка) Тогда
		ГрузоперевозчикКонтрагент = Параметры.Грузоперевозчик.Ссылка;
		ГрузоперевозчикПараметры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГрузоперевозчикКонтрагент, "ИНН,КПП,НаименованиеПолное,Наименование");
		ГрузоперевозчикПараметры.Наименование = 
			?(ЗначениеЗаполнено(ГрузоперевозчикПараметры.НаименованиеПолное),
			ГрузоперевозчикПараметры.НаименованиеПолное,
			ГрузоперевозчикПараметры.Наименование);
				
		ЗаполнитьЗначенияСвойств(Параметры.Грузоперевозчик, ГрузоперевозчикПараметры);
		
	КонецЕсли;
	
	// Заполним значения адресов
	Попытка
		СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Отправитель.Адрес);
	Исключение
		ТекстСообщения = НСтр("ru='Адрес отправителя не прошел проверку. Заполнение пропущено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	Попытка
		СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Получатель.Адрес);
	Исключение
		ТекстСообщения = НСтр("ru='Адрес получателя не прошел проверку. Заполнение пропущено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	Попытка
		СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Отправитель.Контрагент.ЮридическийАдрес);
	Исключение
		ТекстСообщения = НСтр("ru='Юридический адрес контрагента отправителя не прошел проверку. Заполнение пропущено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	Попытка
		СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Получатель.Контрагент.ЮридическийАдрес);
	Исключение
		ТекстСообщения = НСтр("ru='Юридический адрес контрагента получателя не прошел проверку. Заполнение пропущено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	//Заполним телефоны контактных лиц
	СервисДоставки.ЗаполнитьПараметрыКонтактногоЛица(Параметры.Отправитель.КонтактноеЛицо);
	
	СервисДоставки.ЗаполнитьПараметрыКонтактногоЛица(Параметры.Получатель.КонтактноеЛицо);
	
	РезультатИтогиПоТаблицеТовары = Результаты[5];
	РезультатНаименованийДляПечати = Результаты[6];
	
	// Заполним параметры грузовых мест
	
	Если Не РезультатИтогиПоТаблицеТовары.Пустой() Тогда
		ВыборкаПоТоварам = РезультатИтогиПоТаблицеТовары.Выбрать();
		Если ВыборкаПоТоварам.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Параметры.Груз, ВыборкаПоТоварам);
			Параметры.ПолнаяСтоимость = ВыборкаПоТоварам.ПолнаяСтоимость;
		КонецЕсли;
	КонецЕсли;
	
	Если Не РезультатНаименованийДляПечати.Пустой() Тогда
		СписокНаименований = ОбщегоНазначения.ВыгрузитьКолонку(РезультатНаименованийДляПечати.Выгрузить(), "ТоварНаименование");
		Параметры.Груз.Содержимое = СтрСоединить(СписокНаименований, ", ");
	КонецЕсли;
	
	РезультатПоТоварнымПозициям = Запрос.МенеджерВременныхТаблиц.Таблицы["Товары"].ПолучитьДанные();
	Если Не РезультатПоТоварнымПозициям.Пустой() Тогда
		
		ВыборкаПоПозиции = РезультатПоТоварнымПозициям.Выбрать();
		
		СоответствиеСтавокНДС = Новый Соответствие;
		ОбменСКонтрагентамиБП.ЗаполнитьСоответствиеСтавокНДС(СоответствиеСтавокНДС);
		
		Пока ВыборкаПоПозиции.Следующий() Цикл
			
			НоваяСтрокаПозиции = Параметры.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПозиции, ВыборкаПоПозиции);
			
			НоваяСтрокаПозиции.ИдентификаторДокументаОснования = XMLСтрока(ВыборкаПоПозиции.ДокументОснование);
			
			НоваяСтрокаПозиции.СтавкаНДС = СоответствиеСтавокНДС.Получить(ВыборкаПоПозиции.СтавкаНДС);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

Процедура ДополнитьЗапросПоОснованиям(ТекстЗапроса, ТекстЗапросаДляДополнения, ПервыйЗапрос, ИмяТаблицы)
	
	Если Не ЗначениеЗаполнено(ТекстЗапросаДляДополнения) Тогда
		Возврат;
	КонецЕсли;
	ТекстЗапросаДляДополнения = СтрЗаменить(ТекстЗапросаДляДополнения, "#ТаблицаДокумента", ИмяТаблицы);
	Если ПервыйЗапрос Тогда
		ПервыйЗапрос = Ложь;
		ТекстЗапроса = ТекстЗапросаДляДополнения;
	Иначе
		ТекстЗапросаДляДополнения = СтрЗаменить(ТекстЗапросаДляДополнения, "ПОМЕСТИТЬ ДанныеОснованийТовары", "");
		ТекстЗапросаДляДополнения = СтрЗаменить(ТекстЗапросаДляДополнения, "ПОМЕСТИТЬ ДанныеОснований", "");
		ТекстЗапросаДляДополнения = СтрЗаменить(ТекстЗапросаДляДополнения, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ");
		ТекстЗапроса = ТекстЗапроса +
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|"
		+ ТекстЗапросаДляДополнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюОснованияЗаказаНаДоставку(ДокументОбъект) Экспорт
	ДопустимыеСостояния = Новый массив;	//Состояния заказа на доставку, при которых допустимо изменять товарный состав в сервисе интеграции
	ДопустимыеСостояния.Добавить(0);	//Черновик
	ДопустимыеСостояния.Добавить(1);	//В обработке
	ДопустимыеСостояния.Добавить(2);	//Забор груза от адреса
	ДопустимыеСостояния.Добавить(3);	//Ожидает доставки в пункт приема груза
	
	ИдентификаторыЗаказовНаДоставку = СервисДоставки.НайтиЗаказыНаДоставкуПоОснованию(ДокументОбъект.Ссылка, Истина, ДопустимыеСостояния);
	Если ЗначениеЗаполнено(ИдентификаторыЗаказовНаДоставку) Тогда
		
		ИмяТабличнойЧасти = "Товары";
		
		ТаблицаТоваров = НовыйОписаниеТаблицыТоваровДокументаОснования();
		
		Для Каждого СтрокаТовары Из ДокументОбъект[ИмяТабличнойЧасти] Цикл
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
		
		ДополнитьТекстЗапросаТоварыДоИзменения(Запрос.Текст);
		ДополнитьТекстЗапросаТоварыПослеИзменения(Запрос.Текст);
		
		Запрос.Текст = Запрос.Текст + "
		|" +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьИзмененияТоварногоСостава
		|ИЗ
		|	ТоварыДоИзменения
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыПослеИзменения
		|		ПО ТоварыДоИзменения.Номенклатура = ТоварыПослеИзменения.Номенклатура
		|		И ТоварыДоИзменения.Количество = ТоварыПослеИзменения.Количество
		|ГДЕ
		|	(ТоварыДоИзменения.Номенклатура ЕСТЬ NULL
		|	ИЛИ ТоварыПослеИзменения.Номенклатура ЕСТЬ NULL)";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяДокумента",
			СтрШаблон("%1.%2", ДокументОбъект.Метаданные().ПолноеИмя(), ИмяТабличнойЧасти));
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Не РезультатЗапроса.Пустой() Тогда
			СервисДоставки.УстановитьПризнакИзмененияЗаказов("ИдентификаторДокумента", ИдентификаторыЗаказовНаДоставку, Истина);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры  

Функция НовыйОписаниеТаблицыТоваровДокументаОснования()
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Отменено", Новый ОписаниеТипов("Булево"));
	
	Возврат Результат;
	
КонецФункции 

Процедура ДополнитьТекстЗапросаТоварыДоИзменения(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + "
	|" +
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыДокументаДоЗаписи
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокументаДоЗаписи.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыДокументаДоЗаписи.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыДоИзменения
	|ИЗ
	|	ТоварыДокументаДоЗаписи КАК ТоварыДокументаДоЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокументаДоЗаписи.Номенклатура" + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаТоварыПослеИзменения(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + "
	|" + 
	"ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	ВТ.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыДокументаПослеЗаписи
	|ИЗ
	|	&ТаблицаТоваров КАК ВТ
	|;
	|
	|ВЫБРАТЬ
	|	ТоварыДокументаПослеЗаписи.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыДокументаПослеЗаписи.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыПослеИзменения
	|ИЗ
	|	ТоварыДокументаПослеЗаписи КАК ТоварыДокументаПослеЗаписи
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокументаПослеЗаписи.Номенклатура
	|" + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораСпособаОпределенияКонтактногоЛица(Форма) Экспорт
	СписокВыбора = Форма.Элементы.СпособОпределенияКонтактногоЛица.СписокВыбора;
	
	СписокВыбора.Вставить(0, 3, НСтр("ru='Ответственный из документа отгрузки'"));
	СписокВыбора.Вставить(0, 4, НСтр("ru='Ответственный из карточки контрагента'"));
	СписокВыбора.Вставить(1, 5, НСтр("ru='Ответственное лицо склада'"));
	СписокВыбора.Вставить(2, 6, НСтр("ru='Текущий пользователь'"));
КонецПроцедуры

Процедура ПриОпределенииОснованийЗаказаНаДоставку(СписокОснований) Экспорт
	Если ТипЗнч(СписокОснований) <> Тип("Массив") Тогда
		ДокументОснование = СписокОснований;
	ИначеЕсли ТипЗнч(СписокОснований) = Тип("Массив") И СписокОснований.Количество() = 1 Тогда
		ДокументОснование = СписокОснований[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Если (ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		И ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.СчетНаОплатуПокупателю")) 
		ИЛИ НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
	
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ДокументОснование
	|	И НЕ РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.СчетНаОплатуПокупателю
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &ДокументОснование
	|	И НЕ РеализацияТоваровУслугТовары.СчетНаОплатуПокупателю.Ссылка ЕСТЬ NULL";
	
	РазрешенныеТипы = Метаданные.ОпределяемыеТипы.ОснованиеЗаказаСервисДоставки.Тип;
	
	СписокОснований = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ РазрешенныеТипы.СодержитТип(ТипЗнч(Выборка.Ссылка)) 
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			Продолжить;
		КонецЕсли;
		
		СписокОснований.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПараметрыКонтактногоЛицаПоУмолчанию(Форма, Параметры) Экспорт
	Если Не Параметры.Контрагент.ЭтоОрганизация Тогда
		Возврат;
	КонецЕсли;
	
	//Заполним контактных лиц
	Если Параметры.КонтактноеЛицо.СпособОпределенияКонтактногоЛица = 3 
		ИЛИ Параметры.КонтактноеЛицо.СпособОпределенияКонтактногоЛица = 0 Тогда // Менеджер из документа основания
		
		Если Форма.ДокументыОснования.Количество() = 1 Тогда
			
			Менеджер = Неопределено;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответсвенный", Форма.ДокументыОснования[0].Значение.Метаданные()) Тогда
				Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ДокументыОснования[0].Значение, "Ответственный");
			КонецЕсли;
			
			Если Менеджер <> Неопределено Тогда
				КонтактноеЛицоОрганиазции = Менеджер.ФизическоеЛицо;
				Если ЗначениеЗаполнено(КонтактноеЛицоОрганиазции) Тогда
					ПараметрыКонтрагента = Параметры.Контрагент;
					Если ПараметрыКонтрагента.ЭтоОрганизация Тогда
						Параметры.КонтактноеЛицо.Ссылка = КонтактноеЛицоОрганиазции;
						СервисДоставки.ЗаполнитьПараметрыКонтактногоЛица(Параметры.КонтактноеЛицо);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Параметры.КонтактноеЛицо.СпособОпределенияКонтактногоЛица = 5 Тогда // Ответственный за склад
		
		ИмяРекзизита = Форма.ТекущийЭлемент.Имя;
		КонтактноеЛицоОрганиазции = Неопределено;
		
		Если ЗначениеЗаполнено(Параметры.Адрес.Владелец) И ТипЗнч(Параметры.Адрес.Владелец) = Тип("СправочникСсылка.Склады") Тогда
			КонтактноеЛицоОрганиазции = ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Параметры.Адрес.Владелец, ОбщегоНазначения.ТекущаяДатаПользователя());
		ИначеЕсли Форма.ДокументыОснования.Количество() = 1 Тогда
			
			ДокументОснование = Форма.ДокументыОснования[0].Значение;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", ДокументОснование.Метаданные()) Тогда
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Склад, Дата");
				КонтактноеЛицоОрганиазции = ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(РеквизитыДокумента.Склад, РеквизитыДокумента.Дата);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтактноеЛицоОрганиазции) Тогда
			ПараметрыКонтрагента = Параметры.Контрагент;
			Если ПараметрыКонтрагента.ЭтоОрганизация Тогда
				Параметры.КонтактноеЛицо.Ссылка = КонтактноеЛицоОрганиазции;
				СервисДоставки.ЗаполнитьПараметрыКонтактногоЛица(Параметры.КонтактноеЛицо);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Параметры.КонтактноеЛицо.СпособОпределенияКонтактногоЛица = 6 Тогда // Текущий пользователь

		КонтактноеЛицоОрганиазции  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.ТекущийПользователь(), "ФизическоеЛицо");
	
		Если ЗначениеЗаполнено(КонтактноеЛицоОрганиазции) Тогда

			ПараметрыКонтрагента = Параметры.Контрагент;
			Если ПараметрыКонтрагента.ЭтоОрганизация Тогда
				Параметры.КонтактноеЛицо.Ссылка = КонтактноеЛицоОрганиазции;
				СервисДоставки.ЗаполнитьПараметрыКонтактногоЛица(Параметры.КонтактноеЛицо);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПараметрыКонтрагента(Параметры) Экспорт
	СведенияОЮрФизлице = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Параметры.Ссылка);
	ЗаполнитьЗначенияСвойств(Параметры, СведенияОЮрФизлице, "ИНН,КПП");
	Параметры.Наименование = СведенияОЮрФизлице.ПолноеНаименование;
	Параметры.ЭтоОрганизация = ТипЗнч(Параметры.Ссылка) = Тип("СправочникСсылка.Организации");
	Если СведенияОЮрФизлице.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Параметры.ЮрФизЛицо = 1;
	Иначе
		Параметры.ЮрФизЛицо = ?(СведенияОЮрФизлице.ИндивидуальныйПредприниматель.Пустая(), 2, 3);
	КонецЕсли;
	
	Если Параметры.ЮрФизЛицо <> 2 Тогда
		Параметры.ЮридическийАдрес.Владелец = Параметры.Ссылка;
		СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.ЮридическийАдрес);
	КонецЕсли;
КонецПроцедуры


#Область ТекстыЗапросов

Функция ШаблонЗапросаДанныеШапкиДокумента()
	Возврат 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК ДокументОснование,
	|	0 КАК ФормаОплаты,
	|	NULL КАК ГрузоперевозчикСсылка,
	|	"""" КАК ГрузоперевозчикИдентификатор,
	|	"""" КАК ГрузоперевозчикНаименование,
	|	"""" КАК ГрузоперевозчикТелефон,
	|	"""" КАК ГрузоперевозчикИНН,
	|	"""" КАК ГрузоперевозчикКПП,
	|	"""" КАК ТарифНаименование,
	|	"""" КАК ТарифИдентификатор,
	|	"""" КАК ТарифНеГабарит,
	|	ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, 1) КАК ДатаОтгрузки,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ВремяОтгрузкиС,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ВремяОтгрузкиПо,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ВремяДоставкиС,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ВремяДоставкиПо,
	|	0 КАК СпособОтгрузки,
	|	0 КАК СпособДоставки,
	|	Т.Ответственный КАК ОтветственныйДокумент,
	|	Т.Контрагент.Ответственный КАК ОтветственныйКонтрагент,
	|	NULL КАК СкладОтправитель,
	|	NULL КАК СкладПолучатель,
	|	NULL КАК ОтправительКонтрагентСсылка,
	|	"""" КАК ОтправительКонтрагентИНН,
	|	"""" КАК ОтправительКонтрагентКПП,
	|	"""" КАК ОтправительКонтрагентНаименование,
	|	0 КАК ОтправительКонтрагентЮрФизЛицо,
	|	NULL КАК ОтправительКонтрагентЮридическийАдресВладелец,
	|	"""" КАК ОтправительКонтрагентЮридическийАдресПредставление,
	|	"""" КАК ОтправительКонтрагентЮридическийАдресЗначение,
	|	ЛОЖЬ КАК ОтправительКонтрагентЭтоОрганизация,
	|	NULL КАК ОтправительАдресВладелец,
	|	"""" КАК ОтправительАдресВладелецНаименование,
	|	"""" КАК ОтправительАдресПредставление,
	|	"""" КАК ОтправительАдресЗначенияПолей,
	|	"""" КАК ОтправительАдресЗначение,
	|	NULL КАК ОтправительКонтактноеЛицоСсылка,
	|	"""" КАК ОтправительКонтактноеЛицоНаименование,
	|	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	|	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	|	NULL КАК ПолучательКонтрагентСсылка,
	|	"""" КАК ПолучательКонтрагентИНН,
	|	"""" КАК ПолучательКонтрагентКПП,
	|	"""" КАК ПолучательКонтрагентНаименование,
	|	0 КАК ПолучательКонтрагентЮрФизЛицо,
	|	NULL КАК ПолучательКонтрагентЮридическийАдресВладелец,
	|	"""" КАК ПолучательКонтрагентЮридическийАдресПредставление,
	|	"""" КАК ПолучательКонтрагентЮридическийАдресЗначение,
	|	ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация,
	|	NULL КАК ПолучательАдресВладелец,
	|	"""" КАК ПолучательАдресВладелецНаименование,
	|	"""" КАК ПолучательАдресПредставление,
	|	"""" КАК ПолучательАдресЗначенияПолей,
	|	"""" КАК ПолучательАдресЗначение,
	|	NULL КАК ПолучательКонтактноеЛицоСсылка,
	|	"""" КАК ПолучательКонтактноеЛицоНаименование,
	|	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	|	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	|	NULL КАК ПлательщикКонтрагентСсылка,
	|	"""" КАК ПлательщикКонтрагентИНН,
	|	"""" КАК ПлательщикКонтрагентКПП,
	|	"""" КАК ПлательщикКонтрагентНаименование,
	|	0 КАК ПлательщикКонтрагентЮрФизЛицо,
	|	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	|	NULL КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	|	"""" КАК ПлательщикКонтрагентЮридическийАдресПредставление,
	|	"""" КАК ПлательщикКонтрагентЮридическийАдресЗначение,
	|	NULL КАК ПлательщикКонтактноеЛицоСсылка,
	|	"""" КАК ПлательщикКонтактноеЛицоНаименование,
	|	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	|	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	|	1 КАК ПлательщикРоль,
	|	"""" КАК ПунктПриемаГрузаИдентификатор,
	|	NULL КАК ПунктПриемаГрузаСсылка,
	|	"""" КАК ПунктВыдачиГрузаИдентификатор,
	|	NULL КАК ПунктВыдачиГрузаСсылка,
	|	0 КАК СуммаДокумента,
	|	NULL КАК ВалютаСсылка,
	|	"""" КАК ВалютаКод,
	|	"""" КАК ВалютаНаименование,
	|	&ПодстановкаСуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	|				И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	|			ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ВалютаКоэффициент,
	|	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	|	ОрганизацииБизнесСеть.Идентификатор КАК ОрганизацияБизнесСетиИдентификатор,
	|	Т.Комментарий КАК ДополнительнаяИнформация
	|ПОМЕСТИТЬ ДанныеОснований
	|ИЗ
	|	#Документ КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	|		ПО Т.Организация = ОрганизацииБизнесСеть.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	|		ПО (ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) = КурсыВалюты.Валюта)
	|ГДЕ
	|	Т.Ссылка В(&Основания)";
КонецФункции

Функция ШаблонЗапросаТоварыДокумента()
	Возврат 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	&ПодстановкаАртикул КАК Артикул,
	|	"""" КАК ИННВладельцаГруза,
	|	"""" КАК ИдентификаторСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	СправочникНоменклатура.ВидНоменклатуры.Услуга КАК ЭтоУслуга,
	|	NULL КАК Упаковка,
	|	&ПодстановкаЦена КАК Цена,
	|	&ПодстановкаКоличество КАК Количество,
	|	&ПодстановкаСумма КАК Сумма,
	|	&ПодстановкаСуммаСкидки КАК СуммаСкидки,
	|	&ПодстановкаСуммаНДС КАК СуммаНДС,
	|	&ПодстановкаСтавкаНДС КАК СтавкаНДС,
	|	0 КАК Вес,
	|	0 КАК Объем,
	|	0 КАК Длина,
	|	0 КАК Ширина,
	|	0 КАК Высота
	|ПОМЕСТИТЬ ДанныеОснованийТовары
	|ИЗ
	|	#ТаблицаДокумента КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	Т.Ссылка В(&Основания)
	|	И &ОтборУслуга";
КонецФункции

Процедура ИзменитьТекстЗапросаПоРеквизитамШапкиОбъекта(ТекстЗапросаПоТипу, Знач ИмяОбъекта, Знач МетаданныеОбъекта)

	ИзменитьТекстЗапросаДляРеквизитаОрганизация(ТекстЗапросаПоТипу, МетаданныеОбъекта);
	ИзменитьТекстЗапросаДляРеквизитаКонтрагент(ТекстЗапросаПоТипу, МетаданныеОбъекта);
	
	ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "#Документ", "Документ."+ИмяОбъекта);
	
	ИзменитьТекстЗапросаДляРеквизитаСклад(ТекстЗапросаПоТипу, МетаданныеОбъекта);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Перевозчик", МетаданныеОбъекта) Тогда
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ГрузоперевозчикСсылка", "Т.Перевозчик КАК ГрузоперевозчикСсылка");
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СпособДоставки", МетаданныеОбъекта) Тогда
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ГрузоперевозчикСсылка", "Т.СпособДоставки.Контрагент КАК ГрузоперевозчикСсылка");
	КонецЕсли;
	
	ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресПредставление",
		"Т.АдресДоставки КАК ПолучательАдресПредставление");
	
	ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресЗначенияПолей",
		"Т.АдресДоставкиЗначение КАК ПолучательАдресЗначенияПолей");
	
	ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресЗначение",
		"Т.АдресДоставкиЗначение КАК ПолучательАдресЗначение");

	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", МетаданныеОбъекта) Тогда
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ВалютаСсылка", "Т.ВалютаДокумента КАК ВалютаСсылка");
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) = КурсыВалюты.Валюта", "Т.ВалютаДокумента = КурсыВалюты.Валюта");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаВключаетНДС", МетаданныеОбъекта) Тогда
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаСуммаВключаетНДС", "Т.СуммаВключаетНДС");
	Иначе
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаСуммаВключаетНДС", "ЛОЖЬ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьТекстЗапросаДляРеквизитаОрганизация(ТекстЗапроса, МетаданныеОбъекта)
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ПлательщикКонтрагентСсылка", "Т.Организация КАК ПлательщикКонтрагентСсылка");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ПлательщикКонтрагентИНН", "Т.Организация.ИНН КАК ПлательщикКонтрагентИНН");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ПлательщикКонтрагентКПП", "Т.Организация.КПП КАК ПлательщикКонтрагентКПП");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ПлательщикКонтрагентНаименование", "Т.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ПлательщикКонтрагентЮридическийАдресВладелец", "Т.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "0 КАК ПлательщикЮрФизЛицо",
									"ВЫБОР
									|	КОГДА Т.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
									|		ТОГДА 1
									|	КОГДА Т.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
									|		ТОГДА 2
									|	КОГДА Т.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо) И Т.Организация.СтатусФизическогоЛица = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛиц.ИндивидуальныйПредприниматель)
									|		ТОГДА 3
									|	ИНАЧЕ 0
									|КОНЕЦ КАК ПлательщикЮрФизЛицо");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ОтправительКонтрагентСсылка", "Т.Организация КАК ОтправительКонтрагентСсылка");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ОтправительКонтрагентИНН", "Т.Организация.ИНН КАК ОтправительКонтрагентИНН");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ОтправительКонтрагентКПП", "Т.Организация.КПП КАК ОтправительКонтрагентКПП");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ОтправительКонтрагентНаименование", "Т.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "0 КАК ОтправительКонтрагентЮрФизЛицо",
									"ВЫБОР
									|	КОГДА Т.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
									|		ТОГДА 1
									|	КОГДА Т.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
									|		ТОГДА 2
									|	КОГДА Т.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо) И Т.Организация.СтатусФизическогоЛица = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛиц.ИндивидуальныйПредприниматель)
									|		ТОГДА 3
									|	ИНАЧЕ 0
									|КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ОтправительКонтрагентЮридическийАдресВладелец", "Т.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛОЖЬ КАК ОтправительКонтрагентЭтоОрганизация", "ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация");
КонецПроцедуры

Процедура ИзменитьТекстЗапросаДляРеквизитаКонтрагент(ТекстЗапроса, МетаданныеОбъекта)
	Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеОбъекта) Тогда
		Возврат;
	КонецЕсли;

	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ПолучательКонтрагентСсылка", 
		"Т.Контрагент КАК ПолучательКонтрагентСсылка");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ПолучательКонтрагентИНН", 
		"Т.Контрагент.ИНН КАК ПолучательКонтрагентИНН");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ПолучательКонтрагентКПП", 
		"Т.Контрагент.КПП КАК ПолучательКонтрагентКПП");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ПолучательКонтактноеЛицоСсылка", 
		"Т.Контрагент.ОсновноеКонтактноеЛицо КАК ПолучательКонтактноеЛицоСсылка");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ПолучательКонтрагентЮридическийАдресВладелец", 
		"Т.Контрагент КАК ПолучательКонтрагентЮридическийАдресВладелец");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ПолучательКонтрагентНаименование",
		"ВЫБОР 
		|	КОГДА Т.Контрагент.НаименованиеПолное <> """" 
		|		ТОГДА Т.Контрагент.НаименованиеПолное 
		|	ИНАЧЕ Т.Контрагент.Наименование 
		|КОНЕЦ КАК ПолучательКонтрагентНаименование");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "0 КАК ПолучательКонтрагентЮрФизЛицо",
		"ВЫБОР
		|	КОГДА Т.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
		|		ТОГДА 1
		|	КОГДА Т.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|		ТОГДА 2
		|	КОГДА Т.Контрагент.ИндивидуальныйПредприниматель
		|		ТОГДА 3
		|	ИНАЧЕ 0
		|КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ПолучательАдресВладелец", 
		"Т.Контрагент КАК ПолучательАдресВладелец");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ПолучательАдресВладелецНаименование", 
		"Т.Контрагент.Наименование КАК ПолучательАдресВладелецНаименование"); 
	
КонецПроцедуры

Процедура ИзменитьТекстЗапросаДляРеквизитаСклад(ТекстЗапроса, Знач МетаданныеОбъекта)
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеОбъекта) Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК СкладОтправитель",
			"Т.Склад КАК СкладОтправитель");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК ОтправительАдресВладелец", 
			"Т.Склад КАК ОтправительАдресВладелец");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """"" КАК ОтправительАдресВладелецНаименование", 
			"Т.Склад.Наименование КАК ОтправительАдресВладелецНаименование");
		
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеОбъекта) Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК СкладОтправитель",
			"Т.СкладОтправитель КАК СкладОтправитель");
		
	КонецЕсли;
КонецПроцедуры

Процедура ИзменитьТекстЗапросаПоРеквизитамТабличнойЧастиОбъекта(ТекстЗапросаПоТипу, Знач МетаданныеОбъектаТЧ, Параметры)
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ИдентификаторСтроки", МетаданныеОбъектаТЧ) Тогда
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
			""""" КАК ИдентификаторСтроки", "Т.ИдентификаторСтроки КАК ИдентификаторСтроки");
	КонецЕсли;				
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Номенклатура", МетаданныеОбъектаТЧ) Тогда
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "%ПодстановкаНоменклатура", "Т.Номенклатура");
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаАртикул", "Т.Номенклатура.Артикул");
	Иначе
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "%ПодстановкаНоменклатура", "НЕОПРЕДЕЛЕНО");
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаАртикул", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	СписокРеквизиты = Новый Структура("Цена,Количество,Сумма,СуммаСкидки,СуммаНДС", 0,0,0,0,0);
	СписокРеквизиты.Вставить("Упаковка", "НЕОПРЕДЕЛЕНО");
	СписокРеквизиты.Вставить("СтавкаНДС", "НЕОПРЕДЕЛЕНО");
	
	Для каждого Реквизит Из СписокРеквизиты Цикл
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(Реквизит.Ключ, МетаданныеОбъектаТЧ) Тогда
			ТекстПодстановки = СтрШаблон("Т.%1",Реквизит.Ключ);
		Иначе
			ТекстПодстановки = Строка(Реквизит.Значение);
		КонецЕсли;
		
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
			СтрШаблон("&Подстановка%1 ",Реквизит.Ключ), ТекстПодстановки+" ");
	КонецЦикла;
		
	Если Параметры.ТипГрузоперевозки = СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СКурьер() Тогда
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
			"&ОтборУслуга", 
			"Истина");
	Иначе
		ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
			"&ОтборУслуга",
			"НЕ СправочникНоменклатура.Услуга");
	КонецЕсли;
КонецПроцедуры

Функция ТекстЗапросаВыборкаИзДанныхОснований()
	Возврат 
	"ВЫБРАТЬ
	|	ШапкаДокумента.ДокументОснование КАК ДокументОснование,
	|	ШапкаДокумента.ОрганизацияБизнесСетиСсылка КАК ОрганизацияБизнесСетиСсылка,
	|	ШапкаДокумента.ФормаОплаты КАК ФормаОплаты,
	|	ШапкаДокумента.ГрузоперевозчикСсылка КАК ГрузоперевозчикСсылка,
	|	ШапкаДокумента.ГрузоперевозчикИдентификатор КАК ГрузоперевозчикИдентификатор,
	|	ШапкаДокумента.ГрузоперевозчикНаименование КАК ГрузоперевозчикНаименование,
	|	ШапкаДокумента.ГрузоперевозчикТелефон КАК ГрузоперевозчикТелефон,
	|	ШапкаДокумента.ГрузоперевозчикИНН КАК ГрузоперевозчикИНН,
	|	ШапкаДокумента.ГрузоперевозчикКПП КАК ГрузоперевозчикКПП,
	|	ШапкаДокумента.ТарифНаименование КАК ТарифНаименование,
	|	ШапкаДокумента.ТарифИдентификатор КАК ТарифИдентификатор,
	|	ШапкаДокумента.ТарифНеГабарит КАК ТарифНеГабарит,
	|	ШапкаДокумента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ШапкаДокумента.ДатаДоставки КАК ДатаДоставки,
	|	ШапкаДокумента.ВремяОтгрузкиС КАК ВремяОтгрузкиС,
	|	ШапкаДокумента.ВремяОтгрузкиПо КАК ВремяОтгрузкиПо,
	|	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ШапкаДокумента.СпособОтгрузки КАК СпособОтгрузки,
	|	ШапкаДокумента.СпособДоставки КАК СпособДоставки, 
	|	ШапкаДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ШапкаДокумента.ОтправительКонтрагентСсылка КАК ОтправительКонтрагентСсылка,
	|	ШапкаДокумента.ОтправительКонтрагентИНН КАК ОтправительКонтрагентИНН,
	|	ШапкаДокумента.ОтправительКонтрагентКПП КАК ОтправительКонтрагентКПП,
	|	ШапкаДокумента.ОтправительКонтрагентНаименование КАК ОтправительКонтрагентНаименование,
	|	ШапкаДокумента.ОтправительКонтрагентЮрФизЛицо КАК ОтправительКонтрагентЮрФизЛицо,
	|	ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация КАК ОтправительКонтрагентЭтоОрганизация,
	|	ШапкаДокумента.ОтправительКонтрагентЮридическийАдресВладелец КАК ОтправительКонтрагентЮридическийАдресВладелец,
	|	ШапкаДокумента.ОтправительАдресВладелец КАК ОтправительАдресВладелец,
	|	ШапкаДокумента.ОтправительАдресВладелецНаименование КАК ОтправительАдресВладелецНаименование,
	|	ШапкаДокумента.ОтправительАдресПредставление КАК ОтправительАдресПредставление,
	|	ШапкаДокумента.ОтправительАдресЗначенияПолей КАК ОтправительАдресЗначенияПолей,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ОтправительАдресПредставление = """"
	|			ТОГДА """"
	|		ИНАЧЕ ШапкаДокумента.ОтправительАдресЗначение
	|	КОНЕЦ КАК ОтправительАдресЗначение,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация
	|			ТОГДА ВЫБОР
	|					КОГДА &СпособОпределенияКонтактногоЛица = 3
	|						ТОГДА МенеджерДокумент.ФизическоеЛицо  
	|					КОГДА &СпособОпределенияКонтактногоЛица = 4
	|						ТОГДА МенеджерКонтрагент.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 5
	|						ТОГДА ОтветственныеЛицаСклада.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 6
	|						ТОГДА ПользователиТекущий.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 2
	|						ТОГДА &ОтветственныйПоУмолчанию
	|					ИНАЧЕ Неопределено
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ОтправительКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаОтправитель.Ссылка, ШапкаДокумента.ОтправительКонтрагентСсылка)
	|				ИНАЧЕ ШапкаДокумента.ОтправительКонтактноеЛицоСсылка
	|			КОНЕЦ
	|	КОНЕЦ КАК ОтправительКонтактноеЛицоСсылка,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация
	|			ТОГДА ШапкаДокумента.ОтправительКонтактноеЛицоНаименование
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ОтправительКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаОтправитель.Наименование, ШапкаДокумента.ОтправительКонтрагентНаименование)
	|				ИНАЧЕ КонтактныеЛицаОтправитель.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ОтправительКонтактноеЛицоНаименование,
	|	ШапкаДокумента.ОтправительКонтактноеЛицоТелефонПредставление КАК ОтправительКонтактноеЛицоТелефонПредставление,
	|	ШапкаДокумента.ОтправительКонтактноеЛицоТелефонЗначение КАК ОтправительКонтактноеЛицоТелефонЗначение,
	|	ШапкаДокумента.ПолучательКонтрагентСсылка КАК ПолучательКонтрагентСсылка,
	|	ШапкаДокумента.ПолучательКонтрагентИНН КАК ПолучательКонтрагентИНН,
	|	ШапкаДокумента.ПолучательКонтрагентКПП КАК ПолучательКонтрагентКПП,
	|	ШапкаДокумента.ПолучательКонтрагентНаименование КАК ПолучательКонтрагентНаименование,
	|	ШапкаДокумента.ПолучательКонтрагентЮрФизЛицо КАК ПолучательКонтрагентЮрФизЛицо,
	|	ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация КАК ПолучательКонтрагентЭтоОрганизация,
	|	ШапкаДокумента.ПолучательКонтрагентЮридическийАдресВладелец КАК ПолучательКонтрагентЮридическийАдресВладелец,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательАдресВладелец = &РозничныйПокупатель
	|			ТОГДА ШапкаДокумента.ПолучательКонтрагентСсылка
	|		ИНАЧЕ ШапкаДокумента.ПолучательАдресВладелец
	|	КОНЕЦ КАК ПолучательАдресВладелец,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательАдресВладелец = &РозничныйПокупатель
	|			ТОГДА ШапкаДокумента.ПолучательКонтрагентНаименование
	|		ИНАЧЕ ШапкаДокумента.ПолучательАдресВладелецНаименование
	|	КОНЕЦ КАК ПолучательАдресВладелецНаименование,
	|	ШапкаДокумента.ПолучательАдресПредставление КАК ПолучательАдресПредставление,
	|	ШапкаДокумента.ПолучательАдресЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательАдресПредставление = """"
	|			ТОГДА """"
	|		ИНАЧЕ ШапкаДокумента.ПолучательАдресЗначение
	|	КОНЕЦ КАК ПолучательАдресЗначение,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация
	|			ТОГДА ВЫБОР
	|					КОГДА &СпособОпределенияКонтактногоЛица = 3
	|						ТОГДА МенеджерДокумент.ФизическоеЛицо  
	|					КОГДА &СпособОпределенияКонтактногоЛица = 4
	|						ТОГДА МенеджерКонтрагент.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 5
	|						ТОГДА ОтветственныеЛицаСклада.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 6
	|						ТОГДА ПользователиТекущий.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 2
	|						ТОГДА &ОтветственныйПоУмолчанию
	|					ИНАЧЕ Неопределено
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ПолучательКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаПолучатель.Ссылка, ШапкаДокумента.ПолучательКонтрагентСсылка)
	|				ИНАЧЕ ШапкаДокумента.ПолучательКонтактноеЛицоСсылка
	|			КОНЕЦ
	|	КОНЕЦ КАК ПолучательКонтактноеЛицоСсылка,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация
	|			ТОГДА ШапкаДокумента.ПолучательКонтактноеЛицоНаименование
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ПолучательКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаПолучатель.Наименование, ШапкаДокумента.ПолучательКонтрагентНаименование)
	|				ИНАЧЕ ЕСТЬNULL(КонтактныеЛицаПолучатель.Наименование, """")
	|			КОНЕЦ
	|	КОНЕЦ КАК ПолучательКонтактноеЛицоНаименование,
	|	ШапкаДокумента.ПолучательКонтактноеЛицоТелефонПредставление КАК ПолучательКонтактноеЛицоТелефонПредставление,
	|	ШапкаДокумента.ПолучательКонтактноеЛицоТелефонЗначение КАК ПолучательКонтактноеЛицоТелефонЗначение,
	|	ШапкаДокумента.ПлательщикКонтрагентСсылка КАК ПлательщикКонтрагентСсылка,
	|	ШапкаДокумента.ПлательщикКонтрагентИНН КАК ПлательщикКонтрагентИНН,
	|	ШапкаДокумента.ПлательщикКонтрагентКПП КАК ПлательщикКонтрагентКПП,
	|	ШапкаДокумента.ПлательщикКонтрагентНаименование КАК ПлательщикКонтрагентНаименование,
	|	ШапкаДокумента.ПлательщикКонтрагентЮрФизЛицо КАК ПлательщикКонтрагентЮрФизЛицо,
	|	ШапкаДокумента.ПлательщикКонтрагентЭтоОрганизация КАК ПлательщикКонтрагентЭтоОрганизация,
	|	ШапкаДокумента.ПлательщикКонтрагентЮридическийАдресВладелец КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоСсылка КАК ПлательщикКонтактноеЛицоСсылка,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоНаименование КАК ПлательщикКонтактноеЛицоНаименование,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоТелефонПредставление КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоТелефонЗначение КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация
	|			ТОГДА 1
	|		КОГДА ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПлательщикРоль,
	|	ШапкаДокумента.ВалютаКоэффициент КАК ВалютаКоэффициент,
	|	ПОДСТРОКА(ШапкаДокумента.ДополнительнаяИнформация, 0, 500) КАК ДополнительнаяИнформация
	|ИЗ
	|	ДанныеОснований КАК ШапкаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛицаОтправитель
	|		ПО ШапкаДокумента.ОтправительКонтактноеЛицоСсылка = КонтактныеЛицаОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛицаПолучатель
	|		ПО ШапкаДокумента.ПолучательКонтактноеЛицоСсылка = КонтактныеЛицаПолучатель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыОтправитель
	|		ПО ШапкаДокумента.СкладОтправитель = СкладыОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыПолучатель
	|		ПО ШапкаДокумента.СкладПолучатель = СкладыПолучатель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК МенеджерДокумент
	|		ПО ШапкаДокумента.ОтветственныйДокумент = МенеджерДокумент.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК МенеджерКонтрагент
	|		ПО ШапкаДокумента.ОтветственныйКонтрагент = МенеджерКонтрагент.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиТекущий
	|		ПО (&ТекущийПользователь = ПользователиТекущий.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица.СрезПоследних(&Дата, ) КАК ОтветственныеЛицаСклада
	|		ПО ШапкаДокумента.СкладОтправитель = ОтветственныеЛицаСклада.СтруктурнаяЕдиница";
КонецФункции

Функция ТекстЗапросаВыборкаИзДанныхОснованийПоТоварам()
	Возврат 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Артикул КАК Артикул,
	|	ТаблицаТовары.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаТовары.ИННВладельцаГруза КАК ИННВладельцаГруза,
	|	ТаблицаТовары.Сумма * ШапкаДокумента.ВалютаКоэффициент КАК Сумма,
	|	ТаблицаТовары.Цена * ШапкаДокумента.ВалютаКоэффициент КАК Цена,
	|	ВЫБОР КОГДА ШапкаДокумента.СуммаВключаетНДС ТОГДА ТаблицаТовары.Сумма ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС КОНЕЦ * ШапкаДокумента.ВалютаКоэффициент КАК СуммаСНДС,
	|	ТаблицаТовары.СуммаНДС * ШапкаДокумента.ВалютаКоэффициент КАК СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаТовары
	|ИЗ
	|	ДанныеОснований КАК ШапкаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОснованийТовары КАК ТаблицаТовары
	|		ПО ШапкаДокумента.ДокументОснование = ТаблицаТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.ДокументОснование КАК ДокументОснование,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.Артикул КАК Артикул,
	|	Товары.ЭтоУслуга КАК ЭтоУслуга,
	|	Товары.ИННВладельцаГруза КАК ИННВладельцаГруза,
	|	СправочникНоменклатура.Наименование КАК Наименование,
	|	СправочникНоменклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СуммаСНДС КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Упаковка КАК Упаковка,
	|	0 КАК ВесЕдиницыТовара,
	|	0 КАК ОбъемЕдиницыТовара,
	|	0 КАК Вес,
	|	0 КАК Объем,
	|	0 КАК ОбъемКоэффициентСм3,
	|	0 КАК Высота,
	|	0 КАК Ширина,
	|	0 КАК Длина,
	|	СправочникНоменклатура.НаименованиеПолное КАК НаименованиеДляПечати
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ВременнаяТаблицаТовары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	Товары.ЭтоУслуга = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.Вес), 0) КАК Вес,
	|	ЕСТЬNULL(СУММА(Товары.Объем), 0) КАК Объем,
	|	ЕСТЬNULL(МАКСИМУМ(Товары.Высота), 0) КАК МаксимальнаяВысота,
	|	ЕСТЬNULL(МАКСИМУМ(Товары.Длина), 0) КАК МаксимальнаяДлина,
	|	ЕСТЬNULL(МАКСИМУМ(Товары.Ширина), 0) КАК МаксимальнаяШирина,
	|	ЕСТЬNULL(МАКСИМУМ(Товары.Вес), 0) КАК МаксимальныйВес,
	|	ЕСТЬNULL(СУММА(Товары.Сумма), 0) КАК ПолнаяСтоимость,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА Товары.ЭтоУслуга
	|					ТОГДА 0
	|				ИНАЧЕ Товары.Сумма
	|			КОНЕЦ), 0) КАК Стоимость
	|ИЗ
	|	Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НаименованиеДляПечати КАК ТоварНаименование
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.ЭтоУслуга
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.НаименованиеДляПечати";
КонецФункции

#КонецОбласти
